[
  {
    "version": "1.0.0",
    "date": "2025-09-24",
    "notes": "Initial release: Editor, map export, interactive viewer."
  },
  {
    "version": "1.0.1",
    "date": "2025-09-24",
    "notes": "### Enhancements\n\n- **Interactive Markers Scaling:** Clicking on a location marker in the editor now scales it up to 105% for better visual feedback.\n- **Visual Feedback Improvements:** Selected markers now have a subtle yellow ring.\n- **Patch Notes Display:** About page now displays patch notes with proper Markdown formatting.\n\n### Bug Fixes\n\n- Fixed issue where clicking a location marker did not provide any interactive feedback."
  },
  {
    "version": "1.0.2",
    "date": "2025-09-25",
    "notes": "### Enhancements\n\n- **Fullscreen Mode Improvements:** Fullscreen now correctly adjusts stage size and maintains aspect ratio.\n- **Touch Gestures:** Pinch-to-zoom and drag-to-pan now smoother on mobile devices.\n- **Legend Interaction:** Users can now move the legend to left, right, or bottom even in fullscreen mode.\n- **Hover Tooltips:** Hovering over locations and regions now shows detailed tooltips on desktop.\n- **Selection Highlighting:** Selected regions and locations are highlighted with cyan strokes; hover highlights with yellow.\n- **Modal Updates:** Modal now shows color indicators, lore descriptions, and optional external links with improved styling.\n\n### Bug Fixes\n\n- Fixed issue where stage scaling and panning could break after pinch gestures.\n- Fixed unassigned locations display in legend not updating correctly after region assignment."
  },
  {
    "version": "1.0.3",
    "date": "2025-09-25",
    "notes": "### Enhancements\n\n- 🎛️ **Better UI Layout Hierarchy:**\n  - Smart Control Panel positioned at the top with proper z-index, glass-morphic design, and never gets covered.\n  - Floating Toolbar sits below the control panel and above the map, with visual grouping, context-sensitive button states, and proper spacing.\n  - Status Bar positioned below the map, displaying real-time editing info with color-coded stats.\n\n- 🖥️ **Enhanced Fullscreen Experience:**\n  - Status Bar now always visible below the map in fullscreen.\n  - Map container uses more viewport space with proper spacing and aspect ratio maintenance.\n  - Sidebar optimized for fullscreen; flex-shrink-0 prevents it from reducing map size.\n  - Min-height and flex adjustments ensure containers use available space efficiently.\n\n- 🎨 **Professional Design Polish:**\n  - Interactive elements have smooth transitions, hover effects, and proper active/disabled states.\n  - Tools are logically grouped with visual separators; color-coded regions and locations.\n  - Improved property panels, drawing previews, and vertex editing feedback.\n\n### Bug Fixes\n\n- Fixed issue where Status Bar was hidden in fullscreen.\n- Fixed map appearing too small in fullscreen.\n- Fixed sidebar interfering with map size when toggled.\n- Fixed overflow and spacing issues using proper flex management and min-h-0 adjustments.\n- Ensured responsive text wrapping and centering in Status Bar on smaller screens."
  }
]
