[
  {
    "version": "1.0.0",
    "date": "2025-09-24",
    "notes": "Initial release: Editor, map export, interactive viewer."
  },
  {
    "version": "1.0.1",
    "date": "2025-09-24",
    "notes": "### Enhancements\n\n- **Interactive Markers Scaling:** Clicking on a location marker in the editor now scales it up to 105% for better visual feedback.\n- **Visual Feedback Improvements:** Selected markers now have a subtle yellow ring.\n- **Patch Notes Display:** About page now displays patch notes with proper Markdown formatting.\n\n### Bug Fixes\n\n- Fixed issue where clicking a location marker did not provide any interactive feedback."
  },
  {
    "version": "1.0.2",
    "date": "2025-09-25",
    "notes": "### Enhancements\n\n- **Fullscreen Mode Improvements:** Fullscreen now correctly adjusts stage size and maintains aspect ratio.\n- **Touch Gestures:** Pinch-to-zoom and drag-to-pan now smoother on mobile devices.\n- **Legend Interaction:** Users can now move the legend to left, right, or bottom even in fullscreen mode.\n- **Hover Tooltips:** Hovering over locations and regions now shows detailed tooltips on desktop.\n- **Selection Highlighting:** Selected regions and locations are highlighted with cyan strokes; hover highlights with yellow.\n- **Modal Updates:** Modal now shows color indicators, lore descriptions, and optional external links with improved styling.\n\n### Bug Fixes\n\n- Fixed issue where stage scaling and panning could break after pinch gestures.\n- Fixed unassigned locations display in legend not updating correctly after region assignment."
  },
  {
    "version": "1.0.3",
    "date": "2025-09-25",
    "notes": "### Enhancements\n\n- **Control Bar Repositioned:** Toolbar now sits below the navigation bar and above the stage to prevent overlapping.\n- **Pinned Status Bar:** Mode, point count, region count, and fullscreen hint are now fixed at the bottom-left of the stage.\n- **Fullscreen Mode Improvements:** ESC now exits fullscreen reliably, and the stage auto-adjusts to viewport size with a floating sidebar.\n- **Responsive Sidebar:** Sidebar dynamically resizes with a translucent, blurred background and displays regions/markers neatly.\n- **Draggable Vertices & Markers:** Region vertices and map markers can be dragged to adjust shape and position.\n- **Adaptive Point Size:** Vertex and marker sizes scale with zoom level for easier editing.\n- **Undo Support Restored:** Cancel or undo last vertex while drawing before saving.\n- **Import/Export Functional:** Regions and markers can now be exported and imported with correct percent coordinates.\n\n### Bug Fixes\n\n- Fixed overlapping toolbar and navbar issue.\n- Fixed stage not resizing correctly on window resize or fullscreen toggle.\n- Fixed inconsistent point scaling when zooming.\n- Fixed marker drag events not updating stored coordinates properly.\n- Fixed preview viewer not updating regions/markers after edits."
  }
]
